In [3]:
file = 'popular-names.txt'

import pandas as pd
df = pd.read_csv(file, sep='\t', header=None)

In [4]:
with open('popular-names.txt', 'r') as file:
    content = file.read()

# 10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [25]:
df.shape[0]

2780

In [29]:
content.count('\n')

2780

In [30]:
#wc -l popular-names.txt

# 11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [18]:
df.to_csv('popular-names_space.txt', sep=' ', header=False, index=False)

In [28]:
with open('popular-names_space.txt', 'w') as file:
    file.write(content.replace('\t', ' '))

In [31]:
#sed -e 's/\t/ /g' popular-names.txt
#expand popular-names.txt --tabs=1 
#cat popular-names.txt | tr "\t" " "

# 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [46]:
df.to_csv('col1.txt', columns=[0], index=False, header=False)
df.to_csv('col2.txt', columns=[1], index=False, header=False)

In [48]:
col1 = ''
col2 = ''

with open('popular-names.txt', 'r') as file:
    for line in file:
        words = line.split()
        col1 += (words[0] + '\n')
        col2 += (words[1] + '\n')
        
with open('col1.txt', 'w') as file:
    file.write(col1)

with open('col2.txt', 'w') as file:
    file.write(col2)

In [51]:
#cut -f 1 popular-names.txt
#cut -f 2 popular-names.txt

# 13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [55]:
df1 = pd.read_csv('col1.txt', header=None)
df2 = pd.read_csv('col2.txt', header=None)

pd.concat([df1, df2], axis=1).to_csv('col.txt', index=False, header=False, sep='\t')

In [72]:
with open('col1.txt', 'r') as f1:
    l1 = f1.readlines()
    
with open('col2.txt', 'r') as f2:
    l2 = f2.readlines()

l = ''
for w1, w2 in zip(l1, l2):
    l += (w1.rstrip() + '\t' + w2.rstrip() + '\n')
    
with open('col.txt', 'w') as f:
    f.write(l)

In [73]:
#paste col1.txt col2.txt

# 14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [80]:
print(df[:10].to_csv(sep='\t', index=False, header=False))

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880
Margaret	F	1578	1880
Ida	F	1472	1880
Alice	F	1414	1880
Bertha	F	1320	1880
Sarah	F	1288	1880

In [79]:
print('\n'.join(content.split('\n')[:10]))

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880
Margaret	F	1578	1880
Ida	F	1472	1880
Alice	F	1414	1880
Bertha	F	1320	1880
Sarah	F	1288	1880

In [1]:
#cat popular_names.txt | head -n 10

# 15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [5]:
print(df[-10:].to_csv(sep='\t', index=False, header=False))

Liam	M	19837	2018
Noah	M	18267	2018
William	M	14516	2018
James	M	13525	2018
Oliver	M	13389	2018
Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

In [7]:
print('\n'.join(content.split('\n')[-11:]))

Liam	M	19837	2018
Noah	M	18267	2018
William	M	14516	2018
James	M	13525	2018
Oliver	M	13389	2018
Benjamin	M	13381	2018
Elijah	M	12886	2018
Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

In [10]:
#cat popular_names.txt | tail -n 10

# 16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [68]:
N = 11
df_tmp = df.copy()
df_tmp['flag'] = pd.qcut(df_tmp.index, N, labels = list(range(N)))
df_tmp

              0  1      2     3 flag
0          Mary  F   7065  1880    0
1          Anna  F   2604  1880    0
2          Emma  F   2003  1880    0
3     Elizabeth  F   1939  1880    0
4        Minnie  F   1746  1880    0
...         ... ..    ...   ...  ...
2775   Benjamin  M  13381  2018   10
2776     Elijah  M  12886  2018   10
2777      Lucas  M  12585  2018   10
2778      Mason  M  12435  2018   10
2779      Logan  M  12352  2018   10

[2780 rows x 5 columns]

In [69]:
#split -l 1000 popular-names.txt --verbose
#split -n 3 popular-names.txt --verbose

# 17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [78]:
len(set(df[0]))

136

In [79]:
#cut -f 1 popular-names.txt | sort | uniq | wc

# 18. 各行を3コラム目の数値の降順にソート
各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [85]:
df.sort_values(by=[2], ascending=False)

            0  1      2     3
1340    Linda  F  99689  1947
1360    Linda  F  96211  1948
1350    James  M  94757  1947
1550  Michael  M  92704  1957
1351   Robert  M  91640  1947
...       ... ..    ...   ...
27      Annie  F   1326  1881
28     Bertha  F   1324  1881
8      Bertha  F   1320  1880
29      Alice  F   1308  1881
9       Sarah  F   1288  1880

[2780 rows x 4 columns]

In [86]:
#sort -nrk 3 popular-names.txt

# 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [102]:
df_tmp = df.copy()
df_tmp['counter'] = 1
df_tmp.sort_values(by=[0]).groupby([0]).sum().sort_values(by=['counter'], ascending=False)

               2       3  counter
0
James    4793512  228848      118
William  3473354  215201      111
Robert   4446240  209027      108
John     4569204  208822      108
Mary     3794381  177146       92
...          ...     ...      ...
Laura      17920    1969        1
Tracy      18468    1970        1
Carolyn    19979    1942        1
Kelly      18235    1977        1
Walter      8962    1914        1

[136 rows x 3 columns]

In [103]:
df[0].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Scott        1
Rachel       1
Kelly        1
Crystal      1
Lucas        1
Name: 0, Length: 136, dtype: int64

In [ ]:
#cut -f 1 popular-names.txt | sort | uniq -c | sort -nrk 1